Tasks/ЗадачаАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Task>
		<Properties>
			<Name>ЗадачаАИТП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗадачАИТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияДействияАИТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДальнейшиеДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияАИТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиАИТП</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыАдресацииЗадачАИТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОшибкиВыполненияАИТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаДляОбработки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОшибкиВыполненияАИТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыполненияЗадачАИТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/ВидыЗадачАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыЗадачАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыВыполненияДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Положительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрицательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/ЗадачаАИТП/Forms/ФормаЗадачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	// Если задача обработки ошибки - вместо описания задачи отображаем ошибку для обработки
	Если Объект.ВидЗадачи = Перечисления.ВидыЗадачАИТП.ОбработкаОшибки Тогда
		
		ЭтаФорма.Элементы.Описание.Видимость = Ложь;
		ЭтаФорма.Элементы.ОшибкаДляОбработкиОписание.Видимость = Истина;
		ЭтаФорма.Элементы.ОшибкаДляОбработки.Видимость = Истина;
		
	КонецЕсли;
	
	// Если результат выполнения задачи ошибка - отображаем ошибку и описание вмето описания результата
	Если  Объект.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Ошибка Тогда
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Истина;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Истина;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Ложь;
		
	Иначе
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Ложь;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Ложь;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Истина;
		
	КонецЕсли;

	Если Объект.Выполнена = Истина И Не ПользователиАИТП.ИмеетРоль("РедактированиеВыполненныхЗадачАИТП") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВедущаяЗадача = Объект.БизнесПроцесс.ВедущаяЗадача;
	
КонецПроцедуры


&НаКлиенте
Процедура СтатусВыполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	// Если результат - ошибка, отображаем ошибку и описание вместо описания результата
	Если  ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияДействияАИТП.Ошибка") Тогда
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Истина;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Истина;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Ложь;
		
	Иначе
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Ложь;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Ложь;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПараметрыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьКартуМаршрута();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтатьИсполнителем(Команда)
	
	СтатьИсполнителемНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКартуМаршрута()
	
	Если ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
		КартаМаршрута = Объект.БизнесПроцесс.ПолучитьОбъект().ПолучитьКартуМаршрута();
	ИначеЕсли Объект.БизнесПроцесс <> Неопределено Тогда
		КартаМаршрута = БизнесПроцессы[Объект.БизнесПроцесс.Метаданные().Имя].ПолучитьКартуМаршрута();
		Возврат;
	Иначе
		КартаМаршрута = Новый ГрафическаяСхема;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтатьИсполнителемНаСервере()
	// Вставить содержимое обработчика.
	Объект.Исполнитель = ПользователиАИТП.ТекущийПользователь();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
